In [9]:
import pandas as pd
import random as rn
import matplotlib.pyplot as plt
import numpy as np
from dataclasses import make_dataclass
from functools import partial
import datetime

In [ ]:
df = pd.DataFrame({
 "Name": [
 "Braund, Mr. Owen Harris",
 "Allen, Mr. William Henry",
 "Bonnell, Miss. Elizabeth",
 ],
 "Age": [22, 35, 58],
 "Sex": ["male", "male", "female"],
 })

display(df)

df["Age"].max()

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

np.int64(58)

In [4]:
cities = pd.read_csv("/Users/dsf-air-27/python_scrypt/myProject/cities.csv")

cities.head(3)

   id first_name last_name  age         city state country  score
0   1      Alice     Smith   25     New York    NY     USA     88
1   2        Bob   Johnson   30  Los Angeles    CA     USA     92
2   3    Charlie  Williams   35      Chicago    IL     USA     79

In [5]:
cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20 non-null     int64
 1   first_name  20 non-null     object
 2   last_name   20 non-null     object
 3   age         20 non-null     int64
 4   city        20 non-null     object
 5   state       20 non-null     object
 6   country     20 non-null     object
 7   score       20 non-null     int64
dtypes: int64(3), object(5)
memory usage: 1.4+ KB

In [9]:
names = cities[["first_name","last_name"]]

names.head(2)

  first_name last_name
0      Alice     Smith
1        Bob   Johnson

In [16]:
above_ninety = cities[cities["score"] > 90]

above_ninety

    id first_name  last_name  age           city state country  score
1    2        Bob    Johnson   30    Los Angeles    CA     USA     92
7    8       Hank     Garcia   38       San Jose    CA     USA     91
10  11      Karen  Hernandez   29  San Francisco    CA     USA     95
14  15     Olivia   Anderson   32      Charlotte    NC     USA     93

In [ ]:
youngest = above_ninety[above_ninety["age"].isin([29,30])]

youngest

    id first_name  last_name  age           city state country  score
1    2        Bob    Johnson   30    Los Angeles    CA     USA     92
10  11      Karen  Hernandez   29  San Francisco    CA     USA     95

In [25]:
# or also

youngest = above_ninety[(above_ninety["age"] == 29) | (above_ninety["age"] == 30)]

youngest

    id first_name  last_name  age           city state country  score
1    2        Bob    Johnson   30    Los Angeles    CA     USA     92
10  11      Karen  Hernandez   29  San Francisco    CA     USA     95